<style scoped>
.main-box {
  width: 90%;
  color: #666;
  margin: 0 auto;
}

.main-box .text-02 {
  font-size: 1.5rem;
  color: #ff4a4a;
  margin: .5rem 0 0 0;
}

.main-box .text-01 {
  margin-top: 1rem;
  text-align: justify;
  line-height: 2rem;
  font-size: 1.4rem;
}

.main-box .text-indent {
  text-indent: 1em;
  margin-top: 0;
}
</style>

<template>
  <div>
    <app-header :title="title"></app-header>

    <div class="main-box">
      <p class="text-01 text-indent" style="margin-top:1rem">欢迎使用淘游夺宝服务。请您仔细阅读以下全部内容。如您不同意本服务协议任意内容，请勿注册或使用淘游夺宝服务（以下简称为“本服务”）。如您使用本服务的，即表示您与淘游夺宝平台（以下简称为“我们”）已达成协议，自愿接受本服务协议的所有内容。此后，您不得再以未阅读本服务协议内容作出抗辩。“请您在注册前务必认真阅读此服务协议的内容并确认，如有任何疑问，应向我们咨询，一旦您确认本服务协议后，本服务协议即在您和我们之间产生法律效力。此后，您不得再以未阅读本服务协议内容作出抗辩。</p>
      <p class="text-02">一、使用本服务的前提条件</p>
      <p class="text-01">1、您在首次使用淘游夺宝时，淘游夺宝会为您生成一个账户ID，用于注册、登陆、使用本服务，同时作为您唯一的身份标识，您或您的监护人需要对此账户项下发生的所有行为负责。您不得以任何形式转让或授权他人使用自己的账户，因此产生的责任须由您全部承担。</p>
      <p class="text-01">2、您使用本服务时，须具备法律规定的权利能力和行为能力，否则将由您的父母或其他法定监护人承担您使用本服务的法律责任。</p>
      <p class="text-01">3、我们仅为您和商家之间的交易行为提供平台网络空间、技术服务等中介服务。我们并不是您或商家的任何一方，所有交易仅存在于您和商家之间，参与淘游夺宝活动产生的法律后果由您和商家自行承担。</p>

      <p class="text-02">二、淘游夺宝服务介绍</p>
      <p class="text-01">1、释义
        <p class="text-01 text-indent">（1）淘游夺宝：旨在为您和商家提供购物服务的网络平台。</p>
        <p class="text-01 text-indent">（2）淘币：您向淘游夺宝充值1人民币后，会获得相应的淘币，淘币的使用方法在不断完善中。淘币将作为您参与淘游夺宝相关活动的凭据。</p>
        <p class="text-01 text-indent">（3）夺宝号码：指您参与本服务时获得的随机分配号码。</p>
        <p class="text-01 text-indent">（4）幸运号码：指某件商品对应的参与号码全部分配完毕后，我们根据规则（详见淘游夺宝平台页面展示）计算出的一个号码。</p>
        <p class="text-01">2、我们承诺遵循公平、公正、公开的原则运营本服务，确保所有用户在本服务中享受同等的权利与义务，向所有用户公示幸运号码。</p>
        <p class="text-01">3、您了解并知悉，除本协议另有约定外，无论是否获得商品，您用于参与本服务所使用的淘币均不能退回；我们不保证您参与本服务一定会获得商品，对此您也完全了解和认同。</p>
        <p class="text-01">4、您通过参与本服务获得的商品，享受该商品生产厂家提供的三包服务，具体三包规定以展示该商品的页面信息为准。</p>
        <p class="text-01">5、我们受商家的委托，将会委托物流公司把商品送到您所指定的送货地址。若因为下列情形导致无法配送或无法及时配送等，您需要自行承担导致的后果：
          <p class="text-01 text-indent">（1）您提供的信息有瑕疵；</p>
          <p class="text-01 text-indent">（2）货物送达无人签收，由此造成的重复配送所产生的费用及相关的后果；</p>
          <p class="text-01 text-indent">（3）不可抗力，例如：自然灾害、交通戒严、突发战争等。</p>
          <p class="text-02">三、淘游夺宝服务管理规则</p>
          <p class="text-01">1、根据相关法律、法规规定以及考虑到本服务的重要性，您同意：
            <p class="text-01 text-indent">（1）提供及时、详尽及准确的个人资料；</p>
            <p class="text-01 text-indent">（2）不断更新个人资料，符合及时、详尽准确的要求。</p>
            <p class="text-01">2、您的个人资料包括但不限于手机号码或收货地址、账号名称、头像、密码等信息。在完善个人资料时，您承诺遵守法律法规、社会主义制度、国家利益、公民合法权益、公共秩序、社会道德风尚和信息真实性等七条底线，不得在资料中出现违法和不良信息，且您保证在完善个人资料和使用账号时，不得有以下情形：
              <p class="text-01 text-indent">（1）违反宪法或法律法规规定的；</p>
              <p class="text-01 text-indent">（2）危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
              <p class="text-01 text-indent">（3）损害国家荣誉和利益的，损害公共利益的；</p>
              <p class="text-01 text-indent">（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p>
              <p class="text-01 text-indent">（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
              <p class="text-01 text-indent">（6）散布谣言，扰乱社会秩序，破坏社会稳定的</p>
              <p class="text-01 text-indent">（7）散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
              <p class="text-01 text-indent">（8）侮辱或者诽谤他人，侵害他人合法权益的；</p>
              <p class="text-01 text-indent">（9）含有法律、行政法规禁止的其他内容的。</p>
              <p class="text-01">3、若您提供给我们的个人资料不准确，不真实，含有违法或不良信息的，我们有权不予开通相关账户，并保留终止您使用本服务的权利。</p>
              <p class="text-01">4、账户转让：由于用户账户关联用户信用信息，仅当有法律明文规定、司法裁定或经淘游夺宝同意，并符合淘游夺宝规则规定的用户账户转让流程的情况下，您可进行账户的转让。您的账户一经转让，该账户项下权利义务一并转移。除此外，您的账户不得以任何方式转让，否则淘游夺宝有权追究您的违约责任，且由此产生的一切责任均由您承担。</p>
              <p class="text-01">5、不活跃账户回收：如您的账户同时符合以下条件，则淘游夺宝可回收您的账户，您的账户将不能再登录淘游夺宝平台，相应服务同时终止：
                <p class="text-01 text-indent">（1）未绑定通过实名认证的手机号码；</p>
                <p class="text-01 text-indent">（2）连续六个月未用于登录淘游夺宝及其相关业务平台；</p>
                <p class="text-01 text-indent">（3）不存在未到期的有效业务。</p>
                <p class="text-01">6、账户安全规范：
                  <p class="text-01 text-indent">（1）账户安全保管义务：您的账户为您自行设置并由您保管，淘游夺宝任何时候均不会主动要求您提供您的账户密码。因此，建议您务必保管好您的账户，并确保您在每个上网时段结束时退出登录并以正确步骤离开淘游夺宝平台。 账户因您主动泄露或因您遭受他人攻击、诈骗等行为导致的损失及后果，淘游夺宝并不承担责任，您应通过司法、行政等救济途径向侵权行为人追偿。
                  </p>
                  <p class="text-01 text-indent">（2）账户行为责任自负：除淘游夺宝存在过错外，您应对您账户项下的所有行为结果（包括但不限于在线签署各类协议、发布信息、购买商品及服务及披露信息等）负责。</p>
                  <p class="text-01 text-indent">（3）日常维护须知：如发现任何未经授权使用您账户登录淘游夺宝平台或其他可能导致您账户遭窃、遗失的情况，建议您立即通知淘游夺宝。您理解淘游夺宝对您的任何请求采取行动均需要合理时间，且淘游夺宝应您请求而采取的行动可能无法避免或阻止侵害后果的形成或扩大，除淘游夺宝存在法定过错外，淘游夺宝不承担责任。</p>
                  <p class="text-01">7、若您以虚假信息骗取账号ID或账号头像，或您的个人简介等注册资料存在违法和不良信息的，我们有权采取通知限期改正、暂停使用、注销登记等措施。对于冒用关联机构或社会名人注册账号名称的，我们有权注销该账号，并向政府主管部门进行报告。</p>
                  <p class="text-01">8、您保证在使用本服务的过程中，遵守诚实信用原则，不扰乱本服务的正常秩序，不通过使用他人账户、一人注册多个账户、使用程序自动处理等不合理方式损害其他用户或我们的利益。</p>
                  <p class="text-01">9、若您在使用本服务中，发表了侵犯他人权利或违反法律规定的言论，我们有权停止传输并删除此言论，及/或禁止您再发言，及/或注销您的账号，及/或回收您账号中的虚拟商品和淘币（如有）。同时，我们保留根据国家法律法规、相关政策向有关机关报告的权利。</p>
                  <p class="text-01">10、若我们发现您存在违法或违反本服务协议约定的行为，我们有权视您违法或违规情况，适用以下一项或多项处罚措施：
                    <p class="text-01 text-indent">（1）责令立即改正违法或违规行为；</p>
                    <p class="text-01 text-indent">（2）中止、终止向您提供部分或全部服务；</p>
                    <p class="text-01 text-indent">（3）取消您的订单并取消商品发放（若您已获得商品的），且您已获得的淘币不予退回；</p>
                    <p class="text-01 text-indent">（4）冻结或注销您账号，及/或回收您账号中的虚拟商品、淘币（如有）；</p>
                    <p class="text-01 text-indent">（5）我们认为不违反法律法规规定的其他处罚措施。若您的行为造成我们及我们关联公司损失的，您还应承担赔偿责任。</p>
                    <p class="text-01">11、如果下列情形发生，我们有权取消您参与活动的申请，在被取消后，您可以要求退还淘币，这些淘币将在10个工作日内退还至您的账号中。
                      <p class="text-01 text-indent">（1）因不可抗力、本服务系统发生故障或遭受第三方攻击，或发生其他我们无法控制的情形；</p>
                      <p class="text-01 text-indent">（2）根据本服务平台已经发布的或将来可能发布或更新的各类规则、公告的规定，我们有权取消您参与资格的其他情形。</p>
                      <p class="text-02">四、您的隐私制度</p>
                      <p class="text-01">我们不会向任何第三方提供，出售，出租，分享和交易您的个人信息。当在以下情况下，您的个人信息将部分或全部被善意披露：</p>
                      <p class="text-01">1、经您同意，向第三方披露；</p>
                      <p class="text-01">2、如您是合资格的知识产权投诉人并已提起投诉，应被投诉人要求，向被投诉人披露，以便双方处理可能的权利纠纷；</p>
                      <p class="text-01">3、根据法律的有关规定，或者行政或司法机构的要求，向第三方或者行政、司法机构披露；</p>
                      <p class="text-01">4、如果您出现违反中国有关法律或者网站政策的情况，需要向第三方披露；</p>
                      <p class="text-01">5、为提供你所要求的产品和服务，而必须和第三方分享用户的个人信息；</p>
                      <p class="text-01">6、其它本站根据法律或者网站政策认为合适的披露。</p>
                      <p class="text-02">五、其他</p>
                      <p class="text-01">1、您了解并知晓：我们会不时公布或修改与本服务协议有关的其他规则、条款，并会在本服务平台的相关页面公告相关信息，这些规则、条款、公告均是本服务协议的组成部分。</p>
                      <p class="text-01">2、我们有权修改本服务协议的内容，并在必要时通过合理方式通知所有用户，如页面公告等。但我们不再对您单独通知。您可在本APP中查阅最新版本服务协议条款。如您不接受修改后的服务协议条款，请您立即停止使用我们的服务，若您继续使用我们的服务将被视为您已经接受我们修改后的协议内容。</p>
                      <p class="text-01">3、对于我们已上架商品，淘游夺宝有权根据市场变动修改商品价格，而无需再对您提前通知。我们分享购物模式，秉着双方自愿原则，分享购物存在风险，我们不对抽取的“幸运编号”结果承担责任，望您谨慎参与。</p>
                      <p class="text-01">4、12个月内未达到“总需参与人次”的商品，您可通过客服申请退款，所退款项将在3个工作日内，退还至您的账户中。我们不需要对您承担额外的赔偿责任。</p>
                      <p class="text-01">5、本站定义的网络服务内容包括：文字、软件、声音、图片、录象、图表、广告中的全部内容；电子邮件的全部内容；本站为您提供的其他信息。所有这些内容受版权、商标、标签和其它财产所有权法律的保护。所以，您只能在本站和广告商授权下才能使用这些内容，而不能擅自复制、再造这些内容、或创造与内容有关的派生产品。本站所有的文章版权归原文作者和本站共同所有，任何人需要转载本站的文章，必须征得原文作者或本站授权。</p>
                      <p class="text-01">6、您在享受各项服务时，应当及时查阅了解修改的内容，并自觉遵守本服务协议。您如继续使用本服务协议涉及的服务，则视为对修改内容的同意，当发生有关争议时，以最新的服务协议为准；您若不同意我们所修改后的内容，请停止使用本服务协议涉及的服务。</p>
                      <p class="text-01">7、您因使用本服务所产生及与本服务有关的争议，由我们与您协商解决。协商不成时，任何一方均可向APP所有权人所在地人民法院提起诉讼。</p>
                      <p class="text-01">8、如您对本服务协议内容有任何疑问，可联系客服进行咨询。</p>
    </div>

    <app-footer></app-footer>
  </div>
</template>

<script>
import AppHeader from '../../components/common-layout/header.component';
import AppFooter from '../../components/common-layout/footer.component';

export default {
  components: {
    AppHeader,
    AppFooter,
  },
  data() {
    return {
      title: '服务协议',
    };
  },
};
</script>


